# SetObjPropVS

## Description
```pascal
FUNCTION SetObjPropVS(
				PropertyID  : LONGINT;
				PropertyVal : BOOLEAN) : BOOLEAN;
```

```python

def vs.SetObjPropVS(PropertyID, PropertyVal):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|PropertyID|LONGINT||
|PropertyVal|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events